{"config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 200, 200, 3], "name": "input_1"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv2d_1", "config": {"dtype": "float32", "activation": "linear", "padding": "same", "trainable": true, "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 8}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "leaky_re_lu_1", "config": {"name": "leaky_re_lu_1", "dtype": "float32", "alpha": 0.0, "trainable": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "conv2d_2", "config": {"dtype": "float32", "activation": "linear", "padding": "same", "trainable": true, "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 8}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "leaky_re_lu_2", "config": {"name": "leaky_re_lu_2", "dtype": "float32", "alpha": 0.0, "trainable": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "max_pooling2d_1", "config": {"dtype": "float32", "padding": "valid", "trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "dropout_1", "config": {"dtype": "float32", "seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.4}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_3", "config": {"dtype": "float32", "activation": "linear", "padding": "same", "trainable": true, "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 16}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "leaky_re_lu_3", "config": {"name": "leaky_re_lu_3", "dtype": "float32", "alpha": 0.0, "trainable": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "conv2d_4", "config": {"dtype": "float32", "activation": "linear", "padding": "same", "trainable": true, "name": "conv2d_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 16}, "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "leaky_re_lu_4", "config": {"name": "leaky_re_lu_4", "dtype": "float32", "alpha": 0.0, "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "max_pooling2d_2", "config": {"dtype": "float32", "padding": "valid", "trainable": true, "name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "dropout_2", "config": {"dtype": "float32", "seed": null, "trainable": true, "name": "dropout_2", "noise_shape": null, "rate": 0.4}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_5", "config": {"dtype": "float32", "activation": "linear", "padding": "same", "trainable": true, "name": "conv2d_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 32}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "leaky_re_lu_5", "config": {"name": "leaky_re_lu_5", "dtype": "float32", "alpha": 0.0, "trainable": true}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "conv2d_6", "config": {"dtype": "float32", "activation": "linear", "padding": "same", "trainable": true, "name": "conv2d_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 32}, "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "leaky_re_lu_6", "config": {"name": "leaky_re_lu_6", "dtype": "float32", "alpha": 0.0, "trainable": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "conv2d_transpose_1", "config": {"dtype": "float32", "activation": "linear", "padding": "same", "trainable": true, "name": "conv2d_transpose_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [2, 2], "output_padding": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 16}, "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"name": "concatenate_1", "config": {"name": "concatenate_1", "dtype": "float32", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}], ["leaky_re_lu_4", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "dropout_3", "config": {"dtype": "float32", "seed": null, "trainable": true, "name": "dropout_3", "noise_shape": null, "rate": 0.4}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_7", "config": {"dtype": "float32", "activation": "linear", "padding": "same", "trainable": true, "name": "conv2d_7", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 16}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "leaky_re_lu_7", "config": {"name": "leaky_re_lu_7", "dtype": "float32", "alpha": 0.0, "trainable": true}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "conv2d_8", "config": {"dtype": "float32", "activation": "linear", "padding": "same", "trainable": true, "name": "conv2d_8", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 16}, "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "leaky_re_lu_8", "config": {"name": "leaky_re_lu_8", "dtype": "float32", "alpha": 0.0, "trainable": true}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "conv2d_transpose_2", "config": {"dtype": "float32", "activation": "linear", "padding": "same", "trainable": true, "name": "conv2d_transpose_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [2, 2], "output_padding": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 8}, "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"name": "concatenate_2", "config": {"name": "concatenate_2", "dtype": "float32", "trainable": true, "axis": 3}, "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}], ["leaky_re_lu_2", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "dropout_4", "config": {"dtype": "float32", "seed": null, "trainable": true, "name": "dropout_4", "noise_shape": null, "rate": 0.4}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv2d_9", "config": {"dtype": "float32", "activation": "linear", "padding": "same", "trainable": true, "name": "conv2d_9", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 8}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "leaky_re_lu_9", "config": {"name": "leaky_re_lu_9", "dtype": "float32", "alpha": 0.0, "trainable": true}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "conv2d_10", "config": {"dtype": "float32", "activation": "linear", "padding": "same", "trainable": true, "name": "conv2d_10", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 8}, "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "leaky_re_lu_10", "config": {"name": "leaky_re_lu_10", "dtype": "float32", "alpha": 0.0, "trainable": true}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "conv2d_11", "config": {"dtype": "float32", "activation": "linear", "padding": "valid", "trainable": true, "name": "conv2d_11", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "filters": 1}, "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "sigmoid", "config": {"name": "sigmoid", "dtype": "float32", "activation": "sigmoid", "trainable": true}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Activation"}], "output_layers": [["sigmoid", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow", "class_name": "Model"}